# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10
number=int(input("Введите число:"))
temp=' '                                               # остаток от деления 
while number != 0:                                     # цикл выполняется пока делимое не будет равно 0
    temp = str(number % 2) + temp                      # перезаписываем temp
    number //= 2                                       # заменяем делимое число,(например 45/2=22) в делимое записываем 22
print(f'Десятичное число {number} в двоичной системе -> {temp}')
